package masir_beheshti;
public class HardCode {
    final static String channelOfphoto = "@fssghijklmnodfhfhnbngnh";
    final static String getChannelOfUsersInfo = "@skdjfhksjdfhskj";
    final static String[] admins = new String[]{"245697580","286470051","92146148"};
    final static String infoBookMatchLastDay = "\uD83D\uDCDA مسابقه #کتابخوانی مسیر بهشتی از کتاب \"سلام بر ابراهیم جلد 1 \" \n" +
            "بودجه بندی سوالات \n" +
            "روز اول : از صفحه 1 تا 30\n" +
            "روز دوم  : از صفحه 31 تا 61 \n" +
            "روز سوم : از صفحه 62 تا 91\n" +
            "مرحله نهایی : از  صفحه 1 تا 101\n" +
            "\n" +
            "\uD83D\uDCD6 نسخه الکترونیکی کتاب را می توانید از طریق ربات مسیر بهشتی  (توشه سفر —- >  کتابخانه —-\u200C > کتاب سلام بر ابراهیم ) دریافت کنید . \n" +
            "\n" +
            "\uD83D\uDDC2 نسخه pdf سوالات را می توانید به صورت یکجا از (توشه سفر —- >  کتابخانه —-\u200C > سوالات مسابقه کتابخوانی ) دریافت کنید .\n" +
            "\n" +
            "\uD83C\uDF81 به برگزیدگان #جوایزی اهدا خواهد شد .\n" +
            "\n" +
            "❕پاسخ های خود را همین جا ارسال کنید .";
    final static String firstLevel = "سوال های روز اول :\n" +
            "۱. کدامیک از اساتید زیر از اساتید شهید ابراهیم هادی بودند ؟\n" +
            "۱.علامه محمدتقی جعفری\n" +
            "۲.حاج حسین الله کرم\n" +
            "۳.حاج آقای حق شناس\n" +
            "۴.همه موارد\n" +
            "\n" +
            "۲.ابراهیم هادی در چه عملیاتی به شهادت رسید ؟\n" +
            "۱.بیت المقدس\n" +
            "۲.والفجر مقدماتی\n" +
            "۳.کربلای ۴\n" +
            "۴.مرصاد\n" +
            "\n" +
            "۳.کدام یک از شهدای زیر از اعضای زورخانه حاج حسین نجار نیستند ؟\n" +
            "۱.حسن شهابی\n" +
            "۲.علی نصر الله\n" +
            "۳.اصغر رنجبران\n" +
            "۴.محمدرضا کریم پرست\n" +
            "\n" +
            "۴.ابراهیم هادی در کدامیک از رشته های ورزشی زیر مهارت داشت ؟\n" +
            "۱.پینگ پنگ\n" +
            "۲.والیبال\n" +
            "۳.فوتبال\n" +
            "۴.همه موارد\n" +
            "\n" +
            "۵. ابراهیم ۵۰۰ تومان پولی که از بچه های غرب تهران گرفته بود را در چه موردی خرج کرد ؟\n" +
            "۱.به هیئت محل کمک کرد\n" +
            "۲.برای خواهرش هدیه خرید\n" +
            "۳.پول را به یک خانواده مستحق بخشید\n" +
            "۴.هیچکدام\n" +
            "\n" +
            "پاسخ خود را به صورت یک عدد ۵ رقمی شامل اعداد ۱ تا ۴ ارسال کنید .\n" +
            "\n" +
            "برای مثال 41232 کد جوابی می باشد که پاسخ سوال اول آن گزینه ۴ می باشد .";
    final static String secondLevel = "سوالات روز دوم :\n" +
            "۱.جمله\"ورزش نباید هدف زندگی باشد \" از کیست ؟\n" +
            "۱.پوریای ولی\n" +
            "۲.ابراهیم هادی\n" +
            "۳.امام خمینی (ره)\n" +
            "۴.هیچکدام\n" +
            "\n" +
            "۲.مسئولیت ابراهیم هادی در سازمان تربیت بدنی چه بود ؟\n" +
            "۱.رئیس خانه کشتی\n" +
            "۲.معاون بازرسی\n" +
            "۳. فرمانده بسیج سازمان\n" +
            "۴. معاون حفاظت فیزیکی\n" +
            "\n" +
            "۳. ابراهیم هادی خود را به بازاریان با چه نامی معرفی کرد ؟\n" +
            "۱.ولی الله\n" +
            "۲.روح الله\n" +
            "۳.یدالله\n" +
            "۴.عزت الله\n" +
            "\n" +
            "۴.روحانی انقلابی مسجد لرزاده قبل از انقلاب که بود ؟\n" +
            "۱.شیخ حسین زاهد\n" +
            "۲.حاج آقا چاوشی\n" +
            "۳. حاج آقا مجتبی تهرانی\n" +
            "۴.حاج آقای مجتهدی\n" +
            "\n" +
            "۵.علت شرکت نکردن ابراهیم هادی در مسابقات کشتی قهرمانی نوجوانان کشور چه بود ؟\n" +
            "۱.حضور ولیعهد در مسابقات\n" +
            "۲. همزمانی با عملیات والفجر مقدماتی\n" +
            "۳. حذف نام او از لیست مسابقات توسط ساواک\n" +
            "۴.هیچکدام\n" +
            "\n" +
            "پاسخ خود را به صورت یک عدد ۵ رقمی شامل اعداد ۱ تا ۴ ارسال کنید .\n" +
            "\n" +
            "برای مثال 41232 کد جوابی می باشد که پاسخ سوال اول آن گزینه ۴ می باشد .";
    final static String thirdLevel = "سوالات روز سوم :\n" +
            "1. اولین منطقه ای که ابراهیم هادی در جنگ وارد شد ؟\n" +
            "1. کردستان\n" +
            "2. سرپل ذهاب\n" +
            "3. خرمشهر\n" +
            "4. گیلان غرب\n" +
            "\n" +
            "2. ابراهیم سابقه تدریس در کدام یک از دروس زیر در مدارس را نداشت ؟\n" +
            "1. ادبیات فارسی\n" +
            "2. عربی\n" +
            "3. تربیت بدنی\n" +
            "4. هیچکدام\n" +
            "\n" +
            "3. فرماندهی سپاه غرب کشور برعهده چه کسی بود ؟\n" +
            "1. اصغر وصالی\n" +
            "2. محمد بروجردی\n" +
            "3.محمود شهبازی\n" +
            "4. ابراهیم هادی\n" +
            "\n" +
            "4. مهر 1359 وقتی ابراهیم و دوستانش در محاصره گیر افتاده بودند چه پیشنهادی برای حل مشکل داشت ؟\n" +
            "1. توسل به امام رضا (ع)\n" +
            "2. خواندن دعای کمیل\n" +
            "3. خواندن دعای توسل\n" +
            "4. تسبیحات حضرت زهرا(س)\n" +
            "\n" +
            "5. جمله \"به نماز نگویید کار دارم ، به کار بگویید نماز دارم\" از کیست ؟\n" +
            "1. شهید رجایی\n" +
            "2. ابراهیم هادی\n" +
            "3. امام خمینی (ره)\n" +
            "4. شهید بهشتی\n" +
            "\n" +
            "* پاسخ خود را همین جا به صورت یک عدد 5 رقمی شامل اعداد 1 تا 4 ارسال کنید .\n" +
            "برای مثال 13423 که دراینجا در سوال اول گزینه اول و در سوال پنجم گزینه سوم انتخاب شده است .";
    final static String finalLevel = "سوالات نهایی :\n" +
            "1. علت بستن آذوقه گروه اندرزگو توسط فرماندهی کل قوا در غرب کشور چه بود ؟\n" +
            "1. سرپیچی ابراهیم هادی از دستوراتشان\n" +
            "2. سخنرانی های ابراهیم هادی علیه بنی صدر\n" +
            "3. نصب تصویر امام خمینی و شهید بهشتی\n" +
            "4. همه موارد\n" +
            "\n" +
            "2. ابراهیم هادی در بزرگسالی در چه وزنی کشتی می گرفت ؟\n" +
            "1.53\n" +
            "2.62\n" +
            "3.68\n" +
            "4.74\n" +
            "\n" +
            "3. گروه شهید اندرزگو در یکسال فعالیت خود چند عملیات انجام داد ؟\n" +
            "1.42\n" +
            "2.52\n" +
            "3.62\n" +
            "4.72\n" +
            "\n" +
            "4.کدام گزینه راجع به ابراهیم هادی صحیح نیست ؟\n" +
            "1. در سال تحصیلی 58-59 به عنوان دبیر نمونه تربیت بدنی انتخاب شد.\n" +
            "2. آشنایی و ارادت خاص دوطرفه با شهید اصغر وصالی داشت\n" +
            "3. مدتی در جبهه های کردستان حضور داشت\n" +
            "4. پیکر او در اروند رود مفقود شد \n" +
            "\n" +
            "5. کدام یک از شهدای زیر در ظهر عاشورا به شهادت رسید ؟\n" +
            "1. حاج ابراهیم همت\n" +
            "2. اصغر وصالی\n" +
            "3.احمد کاظمی\n" +
            "4. حسین خرازی\n" +
            "\n" +
            "\n" +
            "6.نام گروه شهید اندرزگو توسط چه کسی انتخاب شد ؟\n" +
            "1. محمد بروجردی\n" +
            "2. شهید بهشتی\n" +
            "3. امام خمینی (ره)\n" +
            "4. ابراهیم هادی\n" +
            "\n" +
            "7. کدام یک از گزینه های زیر از تربیت شدگان گروه اندرزگو نیستند ؟\n" +
            "1.ابراهیم حسامی\n" +
            "2.رضا گودینی\n" +
            "3.داریوش ریزه وندی\n" +
            "4. محمود شهبازی\n" +
            "\n" +
            "8. علت کمک ابراهیم هادی به پیرزن ارمنی چه بود ؟\n" +
            "1. کمک نکردن کمیته امداد\n" +
            "2. دلگرم شدن به امام و انقلاب\n" +
            "3. بی کس بودن و غریبه بودن پیرزن\n" +
            "4. همه موارد\n" +
            "\n" +
            "9.حدیث \"کسی که لقمه ای از حرام بخورد نماز چهل شب و دعای چهل روز او قبول نیست\" از کیست ؟\n" +
            "1.پیامبر اکرم(ص)\n" +
            "2. امام علی(ع)\n" +
            "3.امام صادق(ع)\n" +
            "4.امام رضا(ع)\n" +
            "\n" +
            "10.تاریخ شهادت ابراهیم هادی ؟\n" +
            "1. ۲۴ تیر  ۱۳۶۴\n" +
            "2. ۲۰ اسفند ۱۳۶۵\n" +
            "3. ۶ آبان ۱۳۶۰\n" +
            " 4. ۲۲ بهمن ۱۳۶۱\n" +
            "\n" +
            "* پاسخ خود را همین جا به صورت یک عدد 10 رقمی شامل اعداد 1 تا 4( به صورت انگلیسی ) ارسال کنید .\n" +
            "برای مثال 1342431223 که دراینجا در سوال اول گزینه اول و در سوال دهم گزینه سوم انتخاب شده است .";
    final static String firstLevel_Answer = "12443";
    final static String secondLevel_Answer = "32321";
    final static String thirdLevel_Answer = "21241";
    final static String finalLevel_Answer = "3424224414";
    final static String Level_Errore = "⚠️ پاسخ شما نامعتبر است .\n" +
            "\n" +
            " ❗️ پاسخ شما باید شامل یک عدد 5 رقمی شامل اعداد 1 تا 4 به صورت انگلیسی باشد .\n" +
            "\n" +
            "❓برای مثال 13423 که دراینجا در سوال اول گزینه اول و در سوال پنجم گزینه سوم انتخاب شده است .";
    final static String Final_Errore = "⚠️ پاسخ شما نامعتبر است .\n" +
            "\n" +
            " ❗️ پاسخ شما باید شامل یک عدد 10 رقمی شامل اعداد 1 تا 4 به صورت انگلیسی باشد .\n" +
            "\n" +
            "❓برای مثال 1323143223 که دراینجا در سوال اول گزینه اول و در سوال دهم گزینه سوم انتخاب شده است .";
    final static String GoodAnswer = "پاسخ شما با موفقیت ارسال گردید .";
    final static String startmatch = "✅ پاسخ روز اول را ارسال کنید .\n" +
            "\n" +
            " ❗️ پاسخ شما باید شامل یک عدد 5 رقمی شامل اعداد 1 تا 4 به صورت انگلیسی باشد .\n" +
            "\n" +
            "❓برای مثال 13423 که دراینجا در سوال اول گزینه اول و در سوال پنجم گزینه سوم انتخاب شده است .";
    final static String GoodAnswerevel1 = "✅ پاسخ روزاول با موفقیت ارسال شد .\n" +
            "\n" +
            "❗️حالا پاسخ روز دوم مسابقه همانند روز  اول (یک عدد 5 رقمی شامل اعداد 1 تا 4 به صورت انگلیسی) ارسال کنید .\n" +
            "\n" +
            "❓برای مثال 13423 که دراینجا در سوال اول گزینه اول و در سوال پنجم گزینه سوم انتخاب شده است .";
    final static String GoodAnswerevel2 = "✅ پاسخ روزدوم با موفقیت ارسال شد .\n" +
            "\n" +
            "❗️حالا پاسخ روز سوم مسابقه همانند روز دوم (یک عدد 5 رقمی شامل اعداد 1 تا 4 به صورت انگلیسی) ارسال کنید .\n" +
            "\n" +
            "❓برای مثال 13423 که دراینجا در سوال اول گزینه اول و در سوال پنجم گزینه سوم انتخاب شده است .";
    final static String GoodAnswerevel3 = "✅ پاسخ روزسوم با موفقیت ارسال شد .\n" +
            "\n" +
            "❗️حالا پاسخ های نهایی مسابقه را (یک عدد 10 رقمی شامل اعداد 1 تا 4 به صورت انگلیسی) ارسال کنید .\n" +
            "\n" +
            "❓برای مثال 1342431223 که دراینجا در سوال اول گزینه اول و در سوال دهم گزینه سوم انتخاب شده است .";
    final static String GoodAnswerevelf = "✅ پاسخ نهایی با موفقیت ارسال شد .\n" +
            "\n" +
            "❕تمامی پاسخ های شما ارسال شد .\n" +
            "\n" +
            "#خداقوت";
    final static String ContactUs ="\n" +
            "ارتباط با برادران:\n" +
            "@m_abdollahzade_a\n" +
            "ارتباط با خواهران:\n" +
            "@rahiyan_sbu";
    final static String picMatch = "\uD83C\uDF04 مسابقه عکاسی\n" +
            "عکس مورد نظر خود را ارسال کنید .";
    final static String picMatch_submit = "عکس شما با موفقیت ارسال گردید .";
    final static String mediaInfo = "\uD83D\uDDC4 توشه سفر\n" +
            " یکی از چهار بخش زیر را انتخاب کنید .";
    final static String canNotParticipate = "کاری برای امروز نمانده است . \n" +
            "با تشکر \uD83D\uDE4F\uD83C\uDFFB";
    final static String botInfo = "✅ #ربات_مسیر_بهشتی همراه شما در این سفر خواهد بود .\n" +
            "\n" +
            "\uD83C\uDF04 مسابقه عکاسی :عکس های خود را با موضوع راهیان نور به ربات ارسال کنید .\n" +
            " به بهترین عکس ها پس از رای گیری در کانال مسیر بهشتی ( @masir_beheshti)  #جوایزی اهدا خواهد شد .\n" +
            "\uD83D\uDDC2 ره توشه سفرشامل رسانه هایی مرتبط با دفاع مقدس و راهیان نور خواهد بود .\n" +
            "\uD83D\uDCDA مسابقه #کتابخوانی از کتاب سلام بر ابراهیم نیز از طریق همین ربات  انجام می گیرد .\n";
    final static String bookmatchInfo = "با سلام \n" +
            "\n" +
            "\uD83D\uDCDAمسابقه #کتابخوانی مسیر بهشتی از کتاب \"سلام بر ابراهیم جلد 1 \" از روز دوشنبه (21 اسفند ماه) تا پنج شنبه ( 24 اسفند ماه) از طریق ربات مسیر بهشتی انجام خواهد شد .\n" +
            "\n" +
            "❓ روزهای دوشنبه تا چهارشنبه هر روز 5 سوال تستی که فقط همان روز فرصت پاسخگویی دارید .\n" +
            "دوشنبه : از صفحه 1 تا 30\n" +
            "سه شنبه : از صفحه 31 تا 61 \n" +
            "چهار شنبه : از صفحه 62 تا 91\n" +
            " و مرحله نهایی مسابقه شامل 10 سوال از  صفحه 1 تا 101 در روز پنج شنبه برگزار خواهد شد .\n" +
            "\n" +
            "\uD83D\uDCD6 نسخه الکترونیکی کتاب را می توانید از طریق ربات مسیر بهشتی  (توشه سفر —- >  کتابخانه —-\u200C > کتاب سلام بر ابراهیم ) دریافت کنید . \n" +
            "\n" +
            "\uD83C\uDF81 به برگزیدگان #جوایزی اهدا خواهد شد .\n" +
            "\n" +
            "#ربات_مسیر_بهشتی \n";
}
